Revit 2027 API
RebarShapeVertex.GetConstraints Method
 Retrieve the list of constraints associated with this vertex.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<RebarShapeConstraint> GetConstraints()
Public Function GetConstraints As IList(Of RebarShapeConstraint)
public:
IList<RebarShapeConstraint^>^ GetConstraints()
member GetConstraints : unit -> IList<RebarShapeConstraint>
Return Value
IList<RebarShapeConstraint>
 The list of constraints.
See Also
Reference
RebarShapeVertex Class
Autodesk.Revit.DB.Structure Namespace